tutorials/compressible/rhoPimpleFoam/ras/angledDuctLTS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wall;
        inGroups        1(wall);
        nFaces          700;
        startFace       63400;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          700;
        startFace       64100;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1400;
        startFace       64800;
    }
    porosityWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       66200;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       67800;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       68200;
    }
)

// ************************************************************************* //
